// login translations for th-TH
export default {
  "login": {
    "appleLoginFail": "การเข้าสู่ระบบด้วย Apple ล้มเหลว",
    "title": "แพลตฟอร์มสร้างสรรค์ AR ไม่ทำงานล่วงเวลา",
    "register": "ลงทะเบียน/เข้าสู่ระบบแพลตฟอร์ม",
    "h1": "ยินดีต้อนรับ!",
    "h4": "พร้อมที่จะเริ่มหรือยัง?",
    "loginTitle": "เข้าสู่ระบบบัญชี",
    "username": "อีเมล",
    "password": "รหัสผ่าน",
    "login": "เข้าสู่ระบบ",
    "loginCode": "รหัสเข้าสู่ระบบ",
    "scanTip": "กรุณาสแกนรหัส QR ด้วยโทรศัพท์มือถือเพื่อเข้าสู่ระบบ",
    "download": "ดาวน์โหลดโปรแกรมที่เกี่ยวข้อง",
    "rules": {
      "username": {
        "message1": "กรุณากรอกชื่อผู้ใช้",
        "message2": "ความยาวชื่อผู้ใช้ควรมากกว่า 4 และน้อยกว่า 20",
        "message3": "ชื่อผู้ใช้รองรับเฉพาะตัวอักษร ตัวเลข ขีดล่าง @ และ .",
        "email": "กรุณากรอกที่อยู่อีเมลที่ถูกต้อง"
      },
      "password": {
        "message1": "กรุณากรอกรหัสผ่าน",
        "message2": "ความยาวรหัสผ่านควรมากกว่า 6 และน้อยกว่า 20",
        "message3": "รหัสผ่านต้องประกอบด้วยตัวพิมพ์ใหญ่ ตัวพิมพ์เล็ก และตัวเลข"
      },
      "repassword": {
        "message1": "กรุณากรอกรหัสผ่านอีกครั้ง",
        "message2": "รหัสผ่านที่ป้อนสองครั้งไม่ตรงกัน"
      }
    },
    "success": "เข้าสู่ระบบสำเร็จ",
    "usernameError": "ชื่อผู้ใช้ผิดพลาด",
    "passwordError": "รหัสผ่านผิดพลาด",
    "error": "การตรวจสอบแบบฟอร์มไม่ผ่าน",
    "createAccount": "สร้างบัญชีใหม่",
    "repassword": "ยืนยันรหัสผ่าน",
    "create": "สร้าง",
    "linkAccount": "ผูกบัญชีที่มีอยู่",
    "logout": {
      "message1": "คุณแน่ใจหรือไม่ว่าต้องการออกจากระบบ?",
      "message2": "แจ้งเตือน",
      "confirm": "ตกลง",
      "cancel": "ยกเลิก",
      "title": "กำลังออกจากระบบ",
      "text": "กำลังออกจากระบบจากเซิร์ฟเวอร์"
    },
    "back": "กลับ",
    "loginResponseMissingToken": "การตอบกลับการเข้าสู่ระบบขาด access_token"
  },
  "imageSelector": {
    "selectImageMethod": "เลือกวิธีการเลือกรูปภาพ",
    "selectFromResource": "เลือกจากคลังทรัพยากร",
    "selectFromResourceDesc": "เลือกจากทรัพยากรรูปภาพที่อัปโหลดแล้ว",
    "uploadLocal": "อัปโหลดรูปภาพจากเครื่อง",
    "uploadLocalDesc": "อัปโหลดไฟล์รูปภาพใหม่",
    "uploadFile": "อัปโหลดไฟล์"
  }
};
